app/Controllers/Admin.php

SELECT *
FROM `about_us`
---
    public function aboutus()
    {
        $model = new AboutusModel();
        $data['aboutus'] = $model->findAll();

SELECT *
FROM `portfolio`
---
    public function portfolio()
    {
        $model = new PortfolioModel();
        $data['portfolio'] = $model->findAll();
        return view('admin/portfolio/portfolio', $data);
    }


    /* this method is to show create aboutus page data.
    and $routes->get('/admin/create-portfolio', 'Admin::createportfolio');