app/Controllers/Admin.php

INSERT INTO `about_us` (`title`, `meta_key_word`, `description`, `is_active`, `created_at`, `updated_at`) VALUES ('asd', 'asd', 'asd', '1', '2023-06-25 16:20:00', '2023-06-25 16:20:00')
---
    public function insert_about_us () {
        $createAt = $this->request->getVar('created_at');
        $updateAt = $this->request->getVar('updated_at');
        $createAt = strtotime($createAt);
        $updateAt = strtotime($updateAt);
        $createTimeStamp = date("Y-m-d H:i:s", $createAt);
        $updateTimeStamp =date("Y-m-d H:i:s", $updateAt);


		$data = [
			/* getVar(varibale) which is the assign value in the form name attribute */
			'title'=>$this->request->getVar('title'),
			'meta_key_word'=>$this->request->getVar('meta_key_word'),
			'description'=>$this->request->getVar('description'),
			'is_active'=>$this->request->getVar('is_active'),
			'created_at'=>$createTimeStamp,
			'updated_at'=>$updateTimeStamp,
		];

//         $timestamp = strtotime("2023-06-25 10:30:00");
// echo $timestamp;


        // dd($data);
       /* making the objects of my user model */
		$model = new AboutusModel();

		$model->insert($data);