app/Models/SoftsolModel.php

INSERT INTO `images` (`file_name`, `image_title`, `page_id`, `page_name`)
VALUES ('1689067337_4f5a4afb6648a753c89c.jpeg','software-1.jpeg',31,'slide ')
---
    public function insertImages($data)
    {
        $db = db_connect();
        $builder = $db->table('images');
        $builder->insertBatch($data);